InformationRegisters/СкидкиСтроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СкидкиСтроки</Name>
			<Comment>Сведения о скидках назначаемых на каждую товарную строку документов</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСкидки</Name>
					<Comment>Значение скидки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Comment>Действует или нет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособВычисления</Name>
					<Comment>Способ вычисления скидки (относительная/абсолютная)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СкидкиСпособВычисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагВытеснения</Name>
					<Comment>Флаг вытеснения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПрайсЛистаПодарка</Name>
					<Comment>Прайс-лист подарка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПрайсЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяСуммаПодарка</Name>
					<Comment>Максимальная сумма на которую можно сделать подарок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Момент последнего изменения скидки. Если момент больше чем "момент последней загрузки" оборудования, то эту скидку надо выгрузить в оборудование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСкидки</Name>
					<Comment>Идентификатор скидки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РегистраторСкидки</Name>
					<Comment>Ссылка на документ, установивший/отменивший данную скидку</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеСкидокСтроки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РучнаяСкидка</Name>
					<Comment>Истина, если скидка задается в ручную. Ложь, если скидка автоматическая</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Товар или вид товара, на который назначается скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачВремя</Name>
					<Comment>Время начала действия скидки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонВремя</Name>
					<Comment>Время окончания действия скидки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДниНедели</Name>
					<Comment>Дни недели, когда действительна скидка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоПодарок</Name>
					<Comment>Истина, если скидка является подарком. Ложь, в противном случае</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Comment>Карта, на которую назначается скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтСуммыНакопленияНаКарте</Name>
					<Comment>Сумма накопительная, применяется совместно с дисконтной картой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалОбслуживания</Name>
					<Comment>Зал/Склад/Отдел в котором действует данная скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Свойство документа, от которого зависить скидка</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтСуммыСтроки</Name>
					<Comment>Сумма, начиная с которой скидка имеет действие</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтКоличества</Name>
					<Comment>Количество, начиная с которого предоставляется скидка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Правило</Name>
					<Comment>Правило расчета скидки по количеству</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаРасчетаСкидкиПоКоличеству</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Comment>Скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкидкаНаТовары</Name>
					<Comment>Скидка на товары</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкидкаНаРаботы</Name>
					<Comment>Скидка на работы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество, переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

WebServices/Price/Ext/Module.bsl
Функция PriceCheck(PriceCheckRequest)
	// Вставить содержимое обработчика.
	PriceCheckType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PriceCheckRequest", "PriceCheckResponse");
	PriceCheck = ФабрикаXDTO.Создать(PriceCheckType);   
	
	ТаблицаОщибок = Новый ТаблицаЗначений;
	ТаблицаОщибок.Колонки.Добавить("Код",	 Новый ОписаниеТипов("Строка"));
	ТаблицаОщибок.Колонки.Добавить("ТекстОшибки",		 Новый ОписаниеТипов("Строка"));
	
	////////////////////////////////////////////////////	
	//ResultMessageDataType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PriceCheckRequest", "ResultMessage");
	//ResultMessageData = ФабрикаXDTO.Создать(ResultMessageDataType); 	
	//TransactionHeaderDataType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PriceCheckRequest", "TransactionHeader");
	//TransactionHeaderData = ФабрикаXDTO.Создать(TransactionHeaderDataType);
	//TransactionHeaderData = PriceCheckRequest.TransactionHeader;      
	//ResultMessageData.Code = "-1";
	//ResultMessageData.Message = "Данная функция не поддерживается текущей версией обмена с WA"; 
	//
	//PriceCheck.ResultMessage = ResultMessageData;  	
	//PriceCheck.TransactionHeader = TransactionHeaderData;  
	//Возврат PriceCheck;
	////////////////////////////////////////////////////
	
    Попытка
		НомерЗаказНаряда = PriceCheckRequest.PriceCheck.DMSRONo;
	Исключение
		НомерЗаказНаряда = "";	    
	КонецПопытки;   	
	Попытка
		IDЗаказНаряда = PriceCheckRequest.PriceCheck.DMSROID;
	Исключение
		IDЗаказНаряда = "";
	КонецПопытки;  
	
	Если ЗначениеЗаполнено(IDЗаказНаряда) Тогда
		Попытка
			ID = Новый УникальныйИдентификатор(IDЗаказНаряда);
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "PC01";
			НоваяСтрока.ТекстОшибки = "Некорректный ID Заказ-наряда";
			PriceCheck = обПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"-1",ТаблицаОщибок);
			Возврат PriceCheck;  	
		КонецПопытки;
		ЗаказНарядСсылка = Документы.ЗаказНаряд.ПолучитьСсылку(ID);
	ИначеЕсли ЗначениеЗаполнено(НомерЗаказНаряда) Тогда
		ЗаказНарядСсылка = Документы.ЗаказНаряд.НайтиПоНомеру(НомерЗаказНаряда, ТекущаяДата());
    	Если обЗначениеНеЗаполнено(ЗаказНарядСсылка) Тогда		
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "PC01";
			НоваяСтрока.ТекстОшибки = "Заказ-наряд с указанным номером не найден";
			PriceCheck = обПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"-1",ТаблицаОщибок);
			Возврат PriceCheck;    
		КонецЕсли;		
	Иначе
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "PC01";
		НоваяСтрока.ТекстОшибки = "Не указаны номер и ID Заказ-наряда";
		PriceCheck = обПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"-1",ТаблицаОщибок);
		Возврат PriceCheck;   
	КонецЕсли;	
	
	ЗаказНарядОбъект = ЗаказНарядСсылка.ПолучитьОбъект();
	Если ЗаказНарядОбъект = Неопределено Тогда
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "PC01";
		НоваяСтрока.ТекстОшибки = "Заказ-наряд с указанным идентификатором не найден";
		PriceCheck = обПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"-1",ТаблицаОщибок);
		Возврат PriceCheck;  	
	КонецЕсли;	
	
	// ТАБЛИЦЫ ТОВАРОВ И РАБОТ
	ТаблицаРабот = Новый ТаблицаЗначений;
	ТаблицаРабот.Колонки.Добавить("Code",		 		 Новый ОписаниеТипов("Строка"));
	ТаблицаРабот.Колонки.Добавить("PackageCode",		 Новый ОписаниеТипов("Строка"));
	ТаблицаРабот.Колонки.Добавить("Quantity",			 Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,2)));
	ТаблицаРабот.Колонки.Добавить("EstimatedHours",		 Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,2)));
	ТаблицаРабот.Колонки.Добавить("Discount",			 Новый ОписаниеТипов("СправочникСсылка.ТипыСкидок"));  
	ТаблицаРабот.Колонки.Добавить("DiscountRate",	 	 Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("PartNumber",		Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("PackageCode",		Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("Quantity",			Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,2)));
	ТаблицаТоваров.Колонки.Добавить("Discount",		 	Новый ОписаниеТипов("СправочникСсылка.ТипыСкидок"));  
	ТаблицаТоваров.Колонки.Добавить("DiscountRate",	 	Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
	
	ТаблицаТоваровКлиента = Новый ТаблицаЗначений;
	ТаблицаТоваровКлиента.Колонки.Добавить("PartNumber",		Новый ОписаниеТипов("Строка"));
	ТаблицаТоваровКлиента.Колонки.Добавить("PartDescription",	Новый ОписаниеТипов("Строка"));
	ТаблицаТоваровКлиента.Колонки.Добавить("Quantity",			Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,2)));
	ТаблицаТоваровКлиента.Колонки.Добавить("UnitOfMeasure",		Новый ОписаниеТипов("Строка"));
	ТаблицаТоваровКлиента.Колонки.Добавить("Comment",			Новый ОписаниеТипов("Строка"));
	
	Попытка
		МассивРабот = PriceCheckRequest.PriceCheck.OPCodes;    		
	Исключение
		МассивРабот = Неопределено;         		
	КонецПопытки;
	
	Попытка
		МассивТоваровКлиента = PriceCheckRequest.PriceCheck.CustomerParts;    		
	Исключение
		МассивТоваровКлиента = Неопределено;         		
	КонецПопытки;             
	
	Если МассивРабот <> Неопределено Тогда
		Для Каждого СтрокаРабота Из МассивРабот.OpCode Цикл
			Попытка
				Code = СтрокаРабота.Code;
			Исключение
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "PC02";
				НоваяСтрока.ТекстОшибки = "Отсутствует код автоработы";
				PriceCheck = обПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"-1",ТаблицаОщибок);
				Возврат PriceCheck;  
			КонецПопытки; 		
			
			Если Code = "OP_Part" Тогда // Товары 						
				Попытка
					МассивТоваров = СтрокаРабота.Parts;  
				Исключение
					МассивТоваров = Неопределено;
				КонецПопытки;
				
				Если МассивТоваров <> Неопределено Тогда    							
					Для Каждого СтрокаНоменклатура Из МассивТоваров.Part Цикл
						НоваяСтрокаНоменклатура = ТаблицаТоваров.Добавить();
						Попытка
							НоваяСтрокаНоменклатура.PartNumber = СтрокаНоменклатура.PartNumber;
						Исключение
							НоваяСтрока = ТаблицаОщибок.Добавить();
							НоваяСтрока.Код = "PC03";
							НоваяСтрока.ТекстОшибки = "Отсутствует артикул номенклатуры";
							PriceCheck = обПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"-1",ТаблицаОщибок);
							Возврат PriceCheck;   
						КонецПопытки;						
						Если обЗначениеНеЗаполнено(НоваяСтрокаНоменклатура.PartNumber) Тогда
							НоваяСтрока = ТаблицаОщибок.Добавить();
							НоваяСтрока.Код = "PC03";
							НоваяСтрока.ТекстОшибки = "Передан пустой артикул номенклатуры";
							PriceCheck = обПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"-1",ТаблицаОщибок);
							Возврат PriceCheck;    
						КонецЕсли;
						
                        Попытка
							НоваяСтрокаНоменклатура.Quantity = Число(СтрокаНоменклатура.Quantity);
							НоваяСтрокаНоменклатура.PackageCode = СтрокаНоменклатура.PackageCode; // NEW PHASE 4
						Исключение
						КонецПопытки;
						Попытка
							DiscountRate = Число(СтрокаНоменклатура.PriceType.DiscountRate); 
							Если DiscountRate > 0 Тогда 
								Запрос = Новый Запрос;
								Запрос.Текст = "ВЫБРАТЬ
								               |	СкидкиСтрокиСрезПоследних.Скидка,
								               |	СкидкиСтрокиСрезПоследних.ЗначениеСкидки
								               |ИЗ
								               |	РегистрСведений.СкидкиСтроки.СрезПоследних(
								               |			,
								               |			ЗначениеСкидки = &ПроцентСкидки
								               |				И Подразделение = &Подразделение
								               |				И СкидкаНаТовары = ИСТИНА
								               |				И РучнаяСкидка = ИСТИНА) КАК СкидкиСтрокиСрезПоследних";
											   
								Запрос.Параметры.Вставить("ПроцентСкидки", DiscountRate);
								Запрос.Параметры.Вставить("Подразделение", ЗаказНарядОбъект.ПодразделениеКомпании);
								ВыборкаСкидок = Запрос.Выполнить().Выбрать();
								Если ВыборкаСкидок.Количество()=0 Тогда  							
									НоваяСтрока = ТаблицаОщибок.Добавить();
									НоваяСтрока.Код = "PC04";
									НоваяСтрока.ТекстОшибки = "Скидка на товары " + СтрокаНоменклатура.PriceType.DiscountRate + "% не зарегистрирована либо не назначена";
									PriceCheck = обПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"-1",ТаблицаОщибок);
									Возврат PriceCheck;   
								Иначе
									ВыборкаСкидок.Следующий();
									НоваяСтрокаНоменклатура.Discount = ВыборкаСкидок.Скидка;
									НоваяСтрокаНоменклатура.DiscountRate = ВыборкаСкидок.ЗначениеСкидки;
								КонецЕсли;    
							КонецЕсли;
						Исключение
						КонецПопытки;
					КонецЦикла;   							
				КонецЕсли;
				
           Иначе // Работы 				
				НоваяСтрокаРабота = ТаблицаРабот.Добавить();
				НоваяСтрокаРабота.Code = Code;
				Если обЗначениеНеЗаполнено(НоваяСтрокаРабота.Code) Тогда
					НоваяСтрока = ТаблицаОщибок.Добавить();
					НоваяСтрока.Код = "PC02";
					НоваяСтрока.ТекстОшибки = "Не задан код автоработы";
					PriceCheck = обПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"-1",ТаблицаОщибок);
					Возврат PriceCheck;   
				КонецЕсли;
	            Попытка
					НоваяСтрокаРабота.Quantity = Число(СтрокаРабота.Quantity); 	
					НоваяСтрокаРабота.EstimatedHours = Число(СтрокаРабота.EstimatedHours); 	
					НоваяСтрокаРабота.PackageCode = СтрокаРабота.PackageCode; // NEW PHASE 4
				Исключение
				КонецПопытки;
	          	Попытка
					DiscountRate = Число(СтрокаРабота.PriceType.DiscountRate); 
					Если DiscountRate > 0 Тогда 
						Запрос = Новый Запрос;
						Запрос.Текст = "ВЫБРАТЬ
						               |	СкидкиСтрокиСрезПоследних.Скидка,
						               |	СкидкиСтрокиСрезПоследних.ЗначениеСкидки
						               |ИЗ
						               |	РегистрСведений.СкидкиСтроки.СрезПоследних(
						               |			,
						               |			ЗначениеСкидки = &ПроцентСкидки
								       |				И Подразделение = &Подразделение
						               |				И СкидкаНаРаботы = ИСТИНА
						               |				И РучнаяСкидка = ИСТИНА) КАК СкидкиСтрокиСрезПоследних
						               |
						               |УПОРЯДОЧИТЬ ПО
						               |	СкидкиСтрокиСрезПоследних.Период УБЫВ";   
									   
						Запрос.Параметры.Вставить("ПроцентСкидки", DiscountRate);
						Запрос.Параметры.Вставить("Подразделение", ЗаказНарядОбъект.ПодразделениеКомпании);
						ВыборкаСкидок = Запрос.Выполнить().Выбрать();
						Если ВыборкаСкидок.Количество()=0 Тогда  							
							НоваяСтрока = ТаблицаОщибок.Добавить();
							НоваяСтрока.Код = "PC04";
							НоваяСтрока.ТекстОшибки = "Скидка на работы " + СтрокаРабота.PriceType.DiscountRate + "% не зарегистрирована либо не назначена";
							PriceCheck = обПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"-1",ТаблицаОщибок);
							Возврат PriceCheck;  
						Иначе
							ВыборкаСкидок.Следующий();
							НоваяСтрокаРабота.Discount = ВыборкаСкидок.Скидка;
							НоваяСтрокаРабота.DiscountRate = ВыборкаСкидок.ЗначениеСкидки;        
						КонецЕсли;  
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	 
	
	// NEW PHASE 4
	Если МассивТоваровКлиента <> Неопределено Тогда
		Для Каждого СтрокаНоменклатура Из МассивТоваровКлиента.CustomerPart Цикл
			НоваяСтрокаТоварКлиента = ТаблицаТоваровКлиента.Добавить();
			Попытка
				НоваяСтрокаТоварКлиента.PartNumber = СтрокаНоменклатура.PartNumber;
			Исключение
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "PC03";
				НоваяСтрока.ТекстОшибки = "Отсутствует артикул запасной части клиента";
				PriceCheck = ПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"-1",ТаблицаОщибок);
				Возврат PriceCheck;   
			КонецПопытки;
			Если обЗначениеНеЗаполнено(НоваяСтрокаТоварКлиента.PartNumber) Тогда
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "PC03";
				НоваяСтрока.ТекстОшибки = "Передан пустой артикул запасной части клиента";
				PriceCheck = ПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"-1",ТаблицаОщибок);
				Возврат PriceCheck;    
			КонецЕсли;
            Попытка
				НоваяСтрокаТоварКлиента.Quantity = Число(СтрокаНоменклатура.Quantity); 	
			Исключение
			КонецПопытки;
			НоваяСтрокаТоварКлиента.PartDescription = СтрокаНоменклатура.PartDescription;
			НоваяСтрокаТоварКлиента.UnitOfMeasure = СтрокаНоменклатура.UnitOfMeasure;
			НоваяСтрокаТоварКлиента.Comment = СтрокаНоменклатура.Comment;
         КонецЦикла;
	КонецЕсли;
	
	// Перерасчёт в объекте заказ-наряд
	СтараяТаблицаРабот = ЗаказНарядОбъект.Работы.Выгрузить(, "Работа");
	Для Каждого СтрокаРаботы Из ТаблицаРабот Цикл
		РаботаСсылка = Справочники.Автоработы.НайтиПоКоду(СтрокаРаботы.Code);
		Если обЗначениеНеЗаполнено(РаботаСсылка) Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "PC02";
			НоваяСтрока.ТекстОшибки = "Авторабота с кодом " + СтрокаРаботы.Code + " не найдена";
			PriceCheck = обПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"-1",ТаблицаОщибок);
			Возврат PriceCheck; 
		Иначе
			СтрокаВЗаявке = ЗаказНарядОбъект.Работы.Найти(РаботаСсылка, "Работа");
			Если СтрокаВЗаявке = Неопределено Тогда
				СтрокаВЗаявке = ЗаказНарядОбъект.Работы.Добавить();
				СтрокаВЗаявке.Основная = Ложь;			
				СтрокаВЗаявке.Работа = РаботаСсылка;
				СтрокаВЗаявке.ИдентификаторРаботы = Новый УникальныйИдентификатор;
				ЗаказНарядОбъект.ОбработкаРеквизита("Работы.Работа", СтрокаВЗаявке);   
			Иначе
				СтрокаВоВременнойТаблице = СтараяТаблицаРабот.Найти(РаботаСсылка, "Работа");
				СтараяТаблицаРабот.Удалить(СтрокаВоВременнойТаблице);
			КонецЕсли;
			Если СтрокаРаботы.EstimatedHours > 0 Тогда
				СтрокаВЗаявке.Коэффициент = СтрокаРаботы.EstimatedHours;
				ЗаказНарядОбъект.ОбработкаРеквизита("Работы.Коэффициент", СтрокаВЗаявке); 
			КонецЕсли;
			Если СтрокаРаботы.Quantity > 0 Тогда
				СтрокаВЗаявке.Количество = СтрокаРаботы.Quantity;
				ЗаказНарядОбъект.ОбработкаРеквизита("Работы.Количество", СтрокаВЗаявке); 
			КонецЕсли;
           	Если ЗначениеЗаполнено(СтрокаРаботы.Discount) И СтрокаРаботы.DiscountRate <> СтрокаВЗаявке.ПроцентСкидки Тогда
				СтрокаВЗаявке.ПроцентСкидки = СтрокаРаботы.DiscountRate;   
				СтрокаВЗаявке.СкидкаНаТовар = СтрокаРаботы.Discount;
				
				ОбработкаРасчетСкидокАвторабот = ЗаказНарядОбъект["ОбработкаРасчетСкидокАвторабот"];

				ОбработкаРасчетСкидокАвторабот.ПодобратьСтрочнуюСкидку(ЗаказНарядОбъект, СтрокаВЗаявке);
				СтрокаВЗаявке.СкидкаНаТовар  = ОбработкаРасчетСкидокАвторабот.ТекущаяСкидкаСтроки;
				СтрокаВЗаявке.ПроцентСкидкиСтроки = ОбработкаРасчетСкидокАвторабот.ТекущийПроцентСкидкиСтроки;
				СтрокаВЗаявке.СуммаСкидкиСтроки = ОбработкаРасчетСкидокАвторабот.ТекущаяСуммаСкидкиСтроки;

				СуммаИтого = 0;				
				СуммаИтого = ЗаказНарядОбъект.Работы.Итог("СуммаСкидки");
				СуммаИтого = СуммаИтого + ЗаказНарядОбъект.Работы.Итог("СуммаСкидкиСтроки");			
				ЗаказНарядОбъект.СуммаСкидкиНаценкиРабот = СуммаИтого;
				
				ЗаказНарядОбъект.ОбработкаРеквизита("Работы.Количество", СтрокаВЗаявке);   			
			КонецЕсли;	
		КонецЕсли;   		
	КонецЦикла;	
	
	СтараяТаблицаЗапчастей = ЗаказНарядОбъект.Товары.Выгрузить(,"Номенклатура");	
	Для Каждого СтрокаНоменклатура Из ТаблицаТоваров Цикл
		НомСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаНоменклатура.PartNumber);
		Если НомСсылка = Справочники.Номенклатура.ПустаяСсылка() Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "PC03";
			НоваяСтрока.ТекстОшибки = "Номенклатура с артикулом " + СтрокаНоменклатура.PartNumber + " не найдена";
			PriceCheck = обПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"-1",ТаблицаОщибок);
			Возврат PriceCheck;       
		Иначе
			СтрокаВЗаявке = ЗаказНарядОбъект.Товары.Найти(НомСсылка, "Номенклатура");
			Если СтрокаВЗаявке = Неопределено Тогда
				СтрокаВЗаявке = ЗаказНарядОбъект.Товары.Добавить();
				СтрокаВЗаявке.Основная = Ложь;				
				СтрокаВЗаявке.Номенклатура = НомСсылка;
				ЗаказНарядОбъект.ОбработкаРеквизита("Товары.Номенклатура",СтрокаВЗаявке);
				СтрокаВЗаявке.СкладКомпании = Справочники.СкладыКомпании.ОсновнойСкладКомпании;  
				ЗаказНарядОбъект.ОбработкаРеквизита("Товары.СтавкаНДС",СтрокаВЗаявке);  
			Иначе
				СтрокаВоВременнойТаблице = СтараяТаблицаЗапчастей.Найти(НомСсылка, "Номенклатура");
				СтараяТаблицаЗапчастей.Удалить(СтрокаВоВременнойТаблице);
			КонецЕсли;
			Если СтрокаНоменклатура.Quantity > 0 Тогда
				СтрокаВЗаявке.Количество = СтрокаНоменклатура.Quantity;
				ЗаказНарядОбъект.ОбработкаРеквизита("Товары.Количество",СтрокаВЗаявке); 
				ЗаказНарядОбъект.ОбработкаРеквизита("Товары.СтавкаНДС",СтрокаВЗаявке);  
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаНоменклатура.Discount) И СтрокаНоменклатура.DiscountRate <> СтрокаВЗаявке.ПроцентСкидки Тогда
				СтрокаВЗаявке.СкидкаНаТовар = СтрокаНоменклатура.Discount;
				СтрокаВЗаявке.ПроцентСкидкиСтроки = СтрокаНоменклатура.DiscountRate;
				СтрокаВЗаявке.СуммаСкидкиСтроки = 0;
				
				ОбработкаРасчетСкидок = ЗаказНарядОбъект["ОбработкаРасчетСкидок"];

				ОбработкаРасчетСкидок.ПодобратьСтрочнуюСкидку(ЗаказНарядОбъект, СтрокаВЗаявке);
				СтрокаВЗаявке.СкидкаНаТовар  = ОбработкаРасчетСкидок.ТекущаяСкидкаСтроки;
				СтрокаВЗаявке.ПроцентСкидкиСтроки = ОбработкаРасчетСкидок.ТекущийПроцентСкидкиСтроки;
				СтрокаВЗаявке.СуммаСкидкиСтроки = ОбработкаРасчетСкидок.ТекущаяСуммаСкидкиСтроки;

				СуммаИтого = 0;				
				СуммаИтого = ЗаказНарядОбъект.Товары.Итог("СуммаСкидки");
				СуммаИтого = СуммаИтого + ЗаказНарядОбъект.Товары.Итог("СуммаСкидкиСтроки");			
				ЗаказНарядОбъект.СуммаСкидкиНаценки = СуммаИтого;
				
				ЗаказНарядОбъект.ОбработкаРеквизита("Товары.СтавкаНДС", СтрокаВЗаявке);					
			КонецЕсли;	
		КонецЕсли;  
	КонецЦикла;	
	
	Для Каждого УдСтрока Из СтараяТаблицаРабот Цикл
		СтрокаВТаблице = ЗаказНарядОбъект.Работы.Найти(УдСтрока.Работа, "Работа");
		СтрокаИсполнителей = ЗаказНарядОбъект.Исполнители.Найти(СтрокаВТаблице.ИдентификаторРаботы, "ИдентификаторРаботы");
		Если Не СтрокаИсполнителей = Неопределено Тогда
        	ЗаказНарядОбъект.Исполнители.Удалить(СтрокаИсполнителей);
		КонецЕсли;
		ЗаказНарядОбъект.Работы.Удалить(СтрокаВТаблице);   	
	КонецЦикла;  	
	Для Каждого УдСтрока Из СтараяТаблицаЗапчастей Цикл
		СтрокаВТаблице = ЗаказНарядОбъект.Товары.Найти(УдСтрока.Номенклатура, "Номенклатура");
		ЗаказНарядОбъект.Товары.Удалить(СтрокаВТаблице);   	
	КонецЦикла;      
	
	// NEW PHASE 4
	ЗаказНарядОбъект.МатериалыЗаказчика.Очистить();
	Для Каждого СтрокаНоменклатура Из ТаблицаТоваровКлиента Цикл
		НомСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаНоменклатура.PartNumber);
		Если ЗначениеЗаполнено(НомСсылка) Тогда
			СтрокаВЗаявке = ЗаказНарядОбъект.МатериалыЗаказчика.Добавить();
			СтрокаВЗаявке.Номенклатура = НомСсылка;
			ЗаказНарядОбъект.ОбработкаРеквизита("МатериалыЗаказчика.Номенклатура", СтрокаВЗаявке);
			Если СтрокаНоменклатура.Quantity > 0 Тогда
				СтрокаВЗаявке.Количество = СтрокаНоменклатура.Quantity;
			КонецЕсли;
		Иначе
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "PC03";
			НоваяСтрока.ТекстОшибки = "Не найден артикул запасной части клиента " + СтрокаНоменклатура.PartNumber;
			PriceCheck = ПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"-1",ТаблицаОщибок);
			Возврат PriceCheck;       
		КонецЕсли;
	КонецЦикла;	           
	
	// Формируем возвращаемый объект
	PriceType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PriceCheckRequest", "Price");
	PriceChk = ФабрикаXDTO.Создать(PriceType); 	

	PriceChk.PartsCampaignDiscountAmount = Формат(ЗаказНарядОбъект.Товары.Итог("СуммаСкидки")+ЗаказНарядОбъект.Товары.Итог("СуммаСкидкиСтроки"),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
	PriceChk.LaborCampaignDiscountAmount = Формат(ЗаказНарядОбъект.Работы.Итог("СуммаСкидки")+ЗаказНарядОбъект.Работы.Итог("СуммаСкидкиСтроки"),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");   
	PriceChk.TotalCampaignDiscountAmount = Формат(ЗаказНарядОбъект.Товары.Итог("СуммаСкидки")+ЗаказНарядОбъект.Товары.Итог("СуммаСкидкиСтроки") + ЗаказНарядОбъект.Работы.Итог("СуммаСкидки")+ЗаказНарядОбъект.Работы.Итог("СуммаСкидкиСтроки"),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
	PriceChk.TotalAmount = Формат(ЗаказНарядОбъект.Товары.Итог("СуммаВсего")+ЗаказНарядОбъект.Работы.Итог("СуммаВсего"),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
	PriceChk.VATAmount = Формат(ЗаказНарядОбъект.Товары.Итог("СуммаНДС"),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
	PriceChk.DiscountDescription = ЗаказНарядОбъект.МаркетинговаяПрограмма.Наименование;  // NEW PHASE 4
	
	OPCodesType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PriceCheckRequest", "ArrayOfOPCode");
	OPCodes = ФабрикаXDTO.Создать(OPCodesType);
	OPCodeType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PriceCheckRequest", "OPCode");
	СуммаДоп = 0;
	Для Каждого Работа Из ЗаказНарядОбъект.Работы Цикл
		OpCode = ФабрикаXDTO.Создать(OPCodeType); 
		Если Работа.Основная Тогда
			OpCode.AdditionalType = "0"; // NEW PHASE 4
		Иначе
			СуммаДоп = СуммаДоп + Работа.СуммаВсего;
			OpCode.AdditionalType = "1";
		КонецЕсли;		
        OpCode.Code = Работа.Работа.Код;
		Если ЗначениеЗаполнено(Работа.Работа.Артикул) Тогда   					
			OpCode.OPCodeType = "1";
			OPCode.DisplayOPCode = Работа.Работа.Артикул;
		Иначе                           					
			OpCode.OPCodeType = "2";
			OPCode.DisplayOPCode = Работа.Работа.Код;
		КонецЕсли;  				
		стрВТаблице = ТаблицаРабот.Найти(OPCode.Code, "Code");
		OPCode.PackageCode 	= ?(стрВТаблице = Неопределено, "", стрВТаблице.PackageCode); // NEW PHASE 4
		OpCode.Description = Работа.Работа.Наименование;
		OpCode.DisplayOPCode = Работа.Работа.Код;
		OpCode.DisplayOPDescription = Работа.Работа.Наименование;
		OpCode.Make = "";
		OpCode.Model = "";			
		OpCode.Engine = "";
		OpCode.Year = "";
		OpCode.Mileage = "";
		OpCode.Period = "";
        OpCode.Quantity = Формат(Работа.Количество,"ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");
		OpCode.DefLinePaymentMethod = "";
		OpCode.CorrectionLOP = "";
		OpCode.SkillLevel = "";			
		OpCode.HazardMaterialCharge = "";					
		OpCode.EstimatedHours = Формат(Работа.Коэффициент,"ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");
		OpCode.PredefinedCauseDescription = "";
		OpCode.CPSIND = "";  	  				
		PriceType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PriceCheckRequest", "PriceType");
		Price = ФабрикаXDTO.Создать(PriceType); 
		Price.UnitPrice = Формат(Работа.Цена*Работа.Коэффициент,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
		Price.TotalPrice = Формат(Работа.СуммаВсего,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
		Price.TotalPriceIncludeTax = Формат(Работа.СуммаВсего,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
		Price.DiscountRate = Формат(?(обЗначениеНеЗаполнено(Работа.ПроцентСкидки),Работа.ПроцентСкидкиСтроки,Работа.ПроцентСкидки),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
		Price.DiscountPrice = Формат(Работа.СуммаСкидки+Работа.СуммаСкидкиСтроки,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
		OpCode.PriceType = Price;  
		PartsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PriceCheckRequest", "ArrayOfPart");
		Parts = ФабрикаXDTO.Создать(PartsType);
		OpCode.Parts = Parts;  				
		OPCodes.OPCode.Добавить(OpCode);
	КонецЦикла;		
	
	OpCode = ФабрикаXDTO.Создать(OPCodeType); 
	OpCode.Code = "OP_Part";
	OpCode.Description = "";
	OpCode.OPCodeType = "";
	OpCode.DisplayOPCode = "";
	OpCode.DisplayOPDescription = "";
	OpCode.Make = "";
	OpCode.Model = "";			
	OpCode.Engine = "";
	OpCode.Year = "";
	OpCode.Mileage = "";
	OpCode.Period = "";
	OpCode.Quantity = Формат(0,"ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");
	OpCode.DefLinePaymentMethod = "";
	OpCode.CorrectionLOP = "";
	OpCode.SkillLevel = "";			
	OpCode.HazardMaterialCharge = "";					
	OpCode.EstimatedHours = Формат(0,"ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");
	OpCode.PredefinedCauseDescription = "";
	OpCode.CPSIND = "";  	
				
	PriceType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PriceCheckRequest", "PriceType");
	Price = ФабрикаXDTO.Создать(PriceType);
	OpCode.PriceType = Price;
	
	PartsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PriceCheckRequest", "ArrayOfPart");
	Parts = ФабрикаXDTO.Создать(PartsType);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Параметры.Вставить("Подразделение", ЗаказНарядОбъект.ПодразделениеКомпании);
	Запрос.Параметры.Вставить("ТаблТовары", ЗаказНарядОбъект.Товары.Выгрузить());
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказНарядТовары.Номенклатура,
	               |	ЗаказНарядТовары.Количество,
	               |	ЗаказНарядТовары.Основная,
	               |	ЗаказНарядТовары.ЕдиницаИзмерения,
	               |	ЗаказНарядТовары.СуммаВсего,
	               |	ЗаказНарядТовары.ПроцентСкидки,
	               |	ЗаказНарядТовары.СуммаСкидки,
	               |	ЗаказНарядТовары.ПроцентСкидкиСтроки,
	               |	ЗаказНарядТовары.СуммаСкидкиСтроки,
	               |	ЗаказНарядТовары.НомерСтроки,
	               |	ЗаказНарядТовары.Цена
	               |ПОМЕСТИТЬ ТаблТовары
	               |ИЗ
	               |	&ТаблТовары КАК ЗаказНарядТовары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблТовары.Номенклатура,
	               |	ТаблТовары.Количество,
	               |	ТаблТовары.Основная,
	               |	ТаблТовары.ЕдиницаИзмерения,
	               |	ТаблТовары.СуммаВсего,
	               |	ТаблТовары.ПроцентСкидки,
	               |	ТаблТовары.СуммаСкидки,
	               |	ТаблТовары.ПроцентСкидкиСтроки,
	               |	ТаблТовары.СуммаСкидкиСтроки,
	               |	ТаблТовары.НомерСтроки,
	               |	ТаблТовары.Цена,
	               |	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0) КАК СвободныйОстаток
	               |ИЗ
	               |	ТаблТовары КАК ТаблТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании.Подразделение = &Подразделение) КАК ОстаткиТоваровКомпанииОстатки
	               |		ПО ТаблТовары.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура";
						   
	Выбор = Запрос.Выполнить().Выбрать();
	
    Пока Выбор.Следующий() Цикл     
		
		PartType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PriceCheckRequest", "Part");
		Part = ФабрикаXDTO.Создать(PartType);
		Part.Manufacturer = "";
		Part.PartNumber = Выбор.Номенклатура.Артикул; 
		Part.PartDescription = Выбор.Номенклатура.Наименование; 
		Part.DisplayPartNumber = Part.PartNumber; 
		Part.Make = "";
		Part.PartStatus = "";  /////////////////  ??????????????? 
		Part.PartType = ?(ЗначениеЗаполнено(Part.PartNumber), "1", "2");
		
		Если Выбор.СвободныйОстаток > 0 Тогда
			Part.QuantityOnHand = Формат(Выбор.СвободныйОстаток,"ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");
			Part.StockQuantity = "Y";
			Part.StockStatus = "";
		Иначе        		
			Part.QuantityOnHand = "0";
			Part.StockQuantity = "N";
			Part.StockStatus = "";
		КонецЕсли;  				     
       
		СтрокаВТаблице = ТаблицаТоваров.Найти(Part.PartNumber, "PartNumber");
		Part.PackageCode 	= ?(СтрокаВТаблице = Неопределено, "", СтрокаВТаблице.PackageCode); // NEW PHASE 4

		Если Выбор.Основная Тогда
			Part.AdditionalType = "0";
		Иначе     			
			СуммаДоп = СуммаДоп + Выбор.СуммаВсего;
			Part.AdditionalType = "1";    // NEW PHASE 4 
		КонецЕсли;   
			
		Part.Remarks = "";    					
		Part.UnitOfMeasure = Выбор.ЕдиницаИзмерения.Наименование;
		Part.Quantity = Формат(Выбор.Количество,"ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");
		Part.ServiceType = ЗаказНарядОбъект.ВидРемонта.КраткоеОбозначение; 
		Part.DisplayRemarks = "";
						
		PriceType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PriceCheckRequest", "PriceType");
		Price = ФабрикаXDTO.Создать(PriceType);
		Price.UnitPrice = Формат(Выбор.Цена,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
		Price.TotalPrice = Формат(Выбор.СуммаВсего,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
		Price.TotalPriceIncludeTax = Формат(Выбор.СуммаВсего,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
		Price.DiscountRate = Формат(?(обЗначениеНеЗаполнено(Выбор.ПроцентСкидки),Выбор.ПроцентСкидкиСтроки,Выбор.ПроцентСкидки),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
		Price.DiscountPrice = Формат(Выбор.СуммаСкидки+Выбор.СуммаСкидкиСтроки,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0"); 
		Part.PriceType = Price;   							
        Parts.Part.Добавить(Part);			  					         
		  				
    КонецЦикла;			
	OpCode.Parts = Parts; 
	OPCodes.OPCode.Добавить(OpCode);
	PriceChk.OPCodes = OPCodes;	
	
	PriceChk.AdditionalRepairOrderSummary = Формат(СуммаДоп,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");    
	
	CustomerPartsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PriceCheckRequest", "ArrayOfCustomerPart");
	CustomerParts = ФабрикаXDTO.Создать(CustomerPartsType); 
	Для Каждого Номенклатура Из ЗаказНарядОбъект.МатериалыЗаказчика Цикл
		CustomerPartType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PriceCheckRequest", "CustomerPart");
		CustomerPart = ФабрикаXDTO.Создать(CustomerPartType); 
		CustomerPart.PartNumber = Номенклатура.Номенклатура.Артикул;
		CustomerPart.PartDescription = Номенклатура.Номенклатура.Наименование;
		CustomerPart.Quantity = Формат(Номенклатура.Количество,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
		CustomerPart.UnitOfMeasure = Номенклатура.ЕдиницаИзмерения.Наименование;
		CustomerPart.Comment = "";
		CustomerParts.CustomerPart.Добавить(CustomerPart);
	КонецЦикла;
	PriceChk.CustomerParts = CustomerParts; 		

    PriceCheck.Price = PriceChk;
	PriceCheck = обПолучитьВозвратWAError("http://wa.dms.webservice/PriceCheckRequest",PriceCheckRequest,PriceCheck,"1",ТаблицаОщибок);
	Возврат PriceCheck;   
КонецФункции
